#include <stdio.h>

/* Описание: вывести таблицу умножения в матричном виде + поля со значениями от 1 до 9
сделайте таблицу равномерной, учитывая количество пробелов в зависимости от разрядности числа
исходя из правила (1 элемент таблицы умножения - 2 знака, т.е. 2 цифры или 1 цифры и пробел
перед цифрой) */

int main() {
    printf("\t|");  // Верхний левый угол (пустое место п.с. также чтобы было красиво)
    
    // столбцы
    for (int i = 1; i <= 9; i++) {
        printf("%d\t|", i);
    }
    printf("\n");
    
    // разделительная линия
    printf("____+");
    for (int i = 1; i <= 9; i++) {
        printf("____");
    }
    printf("\n");
    
    for (int i = 1; i <= 9; i++) {
        // строки
        printf("%d\t|", i);
        
        // Вывод произведения
        for (int j = 1; j <= 9; j++) {
            printf("%d\t|", i * j);  
        }
        printf("\n");
    }
    
    return 0;
}
