#include <stdio.h>
#include <stdbool.h>

/* Описание: 
В школе на физкультуру выходят ученики. 
Вам нужно разработать программу, которая принимает рост каждого ученика и выводит рост всех учеников в порядке убывания (от самого высокого к самому низкому).
Нельзя использовать массивы для хранения данных.
У каждого ученика есть только один параметр - рост, и программа должна выводить текущий отсортированный список после прихода каждого нового ученика. */

// Мною было решенно что находит 3 самых высоких
int main() {
    
    // В Первую переменную вводятся рост учеников, а остальные для сортировки
    float maxHeight, max1 = 0, max2 = 0, max3 = 0;
    
    while (true) {
        printf("Введите рост ученика (Чтобы выйти напишите 0)\n");
        scanf("%f", &maxHeight);
        
        // для выхода из цикла
        if (maxHeight <= 0) break;
        
        // для сортировки
        if (maxHeight > max1) {
            max3 = max2;
            max2 = max1;
            max1 = maxHeight;
        }
        else if (maxHeight > max2) {
            max3 = max2;
            max2 = maxHeight;
        }
        else if (maxHeight > max3){
            max3 = maxHeight;
        }
    }
    
    printf("Номер 1: %.2f\nНомер 2: %.2f\nНомер 3: %.2f", max1, max2, max3);
    
    return 0;
}
